Catalogs/КР_КлассификацияОбъемовГруза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КР_КлассификацияОбъемовГруза</Name>
			<Comment>A2105505-376</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МинимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВеличины</Name>
					<Comment>A2105505-376</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КР_ВидыТарифовПеревозчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КР_КлассификацияОбъемовГруза/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ЗапрещеноРедактировать = Ложь;
		Справочники.КР_КлассификацияОбъемовГруза.ПроверитьРазрешениеРедактирования(Объект.Ссылка, ЗапрещеноРедактировать);
		Если ЗапрещеноРедактировать Тогда
			ЭтотОбъект.ТолькоПросмотр = Истина;
		КонецЕсли;  
	КонецЕсли;

КонецПроцедуры  

// << 05.10.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-325
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Ссылка"              , Объект.Ссылка);
	ПараметрыПроверки.Вставить("ТипВеличины"         , Объект.ТипВеличины);
	ПараметрыПроверки.Вставить("МинимальноеЗначение" , Объект.МинимальноеЗначение);
	ПараметрыПроверки.Вставить("МаксимальноеЗначение", Объект.МаксимальноеЗначение);
	
	Если Не ДанныеУникальны(ПараметрыПроверки) Тогда
		ТекстОшибки = НСтр("ru = 'Значение ""%1"" ""%2"" ""%3"" уже существует. Элемент не может быть записан.'");
		ТекстОшибки = СтрШаблон(
			ТекстОшибки,
			ПараметрыПроверки.ТипВеличины,
			ПараметрыПроверки.МинимальноеЗначение,
			ПараметрыПроверки.МаксимальноеЗначение);
		
		ПоказатьПредупреждение(, ТекстОшибки);
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // >> 05.10.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-325

#КонецОбласти

#Область СлужебныеПроцедурыФункции

// << 05.10.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-325
&НаСервереБезКонтекста
Функция ДанныеУникальны(ПараметрыПроверки)
	
	// Контроль уникальности
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	КР_КлассификацияОбъемовГруза.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КР_КлассификацияОбъемовГруза КАК КР_КлассификацияОбъемовГруза
	|ГДЕ
	|	КР_КлассификацияОбъемовГруза.Ссылка <> &Ссылка
	|	И КР_КлассификацияОбъемовГруза.МинимальноеЗначение = &МинимальноеЗначение
	|	И КР_КлассификацияОбъемовГруза.МаксимальноеЗначение = &МаксимальноеЗначение
	|	И КР_КлассификацияОбъемовГруза.ТипВеличины = &ТипВеличины";
	
	Запрос.УстановитьПараметр("Ссылка"              , ПараметрыПроверки.Ссылка);
	Запрос.УстановитьПараметр("ТипВеличины"         , ПараметрыПроверки.ТипВеличины);
	Запрос.УстановитьПараметр("МинимальноеЗначение" , ПараметрыПроверки.МинимальноеЗначение);
	Запрос.УстановитьПараметр("МаксимальноеЗначение", ПараметрыПроверки.МаксимальноеЗначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // >> 05.10.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-325

#КонецОбласти
